# Задача №3. Решение в группах
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них 

a = 20 
b = 21
c = 22
# p = ((a+b+c)//2)
# print(p+p%2)   первый способ

# p = (a+b+c)
# print((p//2)+(p%2!=0))  второй способ

# print(((a//2) + (a%2!=0)) + ((b//2)+(b%2!=0)) + ((c//2)+(c%2!=0)))  третий способ

# print((abs(-a//2)) + abs((-b//2)) + abs((-c//2)))  четветрый способ

# print(((a+1)//2) + ((b+1)//2) + ((c+1)//2))  пятый способ







